<?php

declare (strict_types = 1);

namespace App\DTO;

class EmailValidationResult
{
    public function __construct(public readonly int $score, public readonly bool $isDeliverable)
    {
    }
}
/* 
    Data Transfer Object (DTO): 
    - هو عبارة عن كائن بسيط يتم استخدامه لنقل البيانات فقط بين أجزاء أو طبقات التطبيق المختلفة.
    - يعني هو مجرد "حقيبة بيانات" لا تحتوي على أي منطق فقط بيانات

    لماذا نستخدم: 
    - تنظيم البيانات:
        يساعد على تنظيم البيانات التي يتم إرسالها أو استقبالها داخل التطبيق.
    -   حماية البيانات:
        يقلل من تسرب البيانات الحساسة أو غير المهمة أثناء نقلها.
    - سهولة الصيانة:
        إذا تغير شكل البيانات، يمكن تعديله  بسهولة دون التأثير على باقي التطبيق.
    - فصل البيانات عن المنطق:
        البيانات تكون في مكان، والعمليات أو الوظائف تكون في مكان آخر.
*/